let handler = async (m, { conn }) => {
  let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
  let videoUrl = 'https://telegra.ph/file/9a39f321f2f250c1985f3.mp4'
  let { name } = global.db.data.users[who]
  m.react('📜')
let str = `
*⎔⋅• ┗╼╃✦⊰⟦﷽⟧⊱✦╄╾┛ •⋅⎔*
*❘╼╼𓏪 قائـمـة 📜 الاوامـر 𓏪╾╾❘*
── • ◈ • ──
*🎶✬⃝┇اهلا👋* ${taguser}
*🎶✬⃝┇أنـا اسـمـــي "غــوكــو"*
*🎶✬⃝┇الـمطـــور* "𝜜𝑴𝑹𝑶 𝑲𝑯𝜜𝑳𝑰𝑫"
*🎶✬⃝┇*وقـــت الـعــمـل* ${uptime}
*🎶✬⃝┇لـاتـنـســی قـبــل كــل امــر ﹙.﹚*
*🎶✬⃝┇هــا لــك أوامـــر الـبــوت ☟*
*🎶✬⃝┇.صلح
> ⏎* *لو البوت مش ظاهر عندك يصلح تشفير* 
> قناة الدعم: https://whatsapp.com/channel/0029Vai5lsFCRs1tg6jJ152f

*〄━━┋ ★الـأوامــر★ ┋━━〄*

*❁ اللهم صّلِ وسَلّمْ عَلۓِ نَبِيْنَا مُحَمد ﷺ ❁*

 *˼‏💠˹ قـسـم الـمـجـمـوعـات╿↶*
━ ── • ⟐ • ── ━
*✎╎📛 ⇠〘 .منشن 〙*    
> *⏎* يمنشن جماعي لكل الاعضاء. 
*✎╎👤 ⇠〘 .مخفي 〙*    
> *⏎* منشن وهمي. 
*✎╎🏷️ ⇠〘 .الجروب 〙*    
> *⏎* يجيبلك معلومات الجروب كامله. 
*✎╎🧾 ⇠〘 .المشرفين 〙*    
> *⏎* يجيبلك قائمة المشرفين. 
*✎╎👻 ⇠〘 .الاشباح 〙*    
> *⏎* يجيبلك الاعضاء اللي ما بتتفاعل. 
*✎╎🔄 ⇠〘 .رستر 〙*    
> *⏎* يرستر او يعمل اعادة تعيين للينك الجروب. 
*✎╎⛩️ ⇠〘 .معلوم_الجروب〙*  
> *⏎* يعطيك معلومات الجروب. 
*✎╎↗️ ⇠〘 .ترقيه〙*  
> *⏎* يرفع مشرف جديد. 
*✎╎↘️ ⇠〘 .خفض〙*  
> *⏎* ينزل مشرف من الاشراف. 
*✎╎🗑 ⇠〘 .حذف〙*  
> *⏎*  يحذف الرساله التى تحدد عليها. 
*✎╎🖇 ⇠〘 .لينك〙*  
> *⏎* يعمل رابط جديد للجروب. 
*✎╎🚫 ⇠〘 .انذار〙*  
> *⏎* يعمل انذار للي تسوي له منشن.
*✎╎⭕ ⇠〘 .الغاء_الانذار〙*  
> *⏎* يلغي الانذار من الشخص الذي لديه انذار. 
*✎╎🚷 ⇠〘 .الانذارات〙*  
> *⏎* يعطيك قائمة بالاشخاص الذين لديهم انذارات.
*✎╎🚸 ⇠〘 .طرد〙*  
> *⏎* يطرد الشخص الذي تسوي له منشن. 
*✎╎📝 ⇠〘 .تغيير_الوصف〙*  
> *⏎* يغير وصف المجموعة.
*✎╎📝 ⇠〘 .تغيير_الاسم〙*  
> *⏎* يغير اسم المجموعة.   
*✎╎📸 ⇠〘 .تغييرالصورة〙*  
> *⏎* تغيير صورة المجموعة. 
*✎╎➕ ⇠〘 .اضافه〙*  
> *⏎* اضافه اشخاص بستعمال الرقم. 
━ ── • ⟐ • ── ━
*˼‏🕌˹ قـسـم الدين╿↶*
━ ── • ⟐ • ── ━
*✎╎🌅 ⇠〘اذكار〙*    
> *⏎* يجيبلك اذكار . 
*✎╎📖 ⇠〘سوره〙*    
> *⏎* اكتب رقم السوره و رح يعطيك شرح لها. 
*✎╎📕 ⇠〘ايات〙*    
> *⏎* يجيبلك ايه من قرأن كريم. 
*✎╎🗣️ ⇠〘 .حديث 〙*    
> *⏎* البوت يرسل احاديث. 
*✎╎🕋 ⇠〘 .ايه 〙*    
> *⏎* اكتب رقم سوره وبعدها رقم الايه بس بصوت شيخ مختلف.
*✎╎🛐 ⇠〘 .الصلاة〙*  
> *⏎* يعطيك مواقين الصلاة في اي بلد. 
*✎╎🗣 ⇠〘 .تلاوة〙*  
> *⏎* يرسلك ايات باصوات مخالفة.  
━ ── • ⟐ • ── ━
*˼‏🔃˹ قـسـم التحويلات╿↶*
━ ── • ⟐ • ── ━
*✎╎🎴 ⇠〘 .ملصق 〙*    
> *⏎* تحويل الصورة لملصق. 
*✎╎©️ ⇠〘 .سرقه 〙*    
> *⏎* سرقة ملصق بحقوقك. 
*✎╎♻️ ⇠〘 .لصوره 〙*    
> *⏎* تحويل الملصق لصورة. 
*✎╎🎞️ ⇠〘 .لفيديو 〙*    
> *⏎* تحويل الملصق المتحرك لفيديو. 
*✎╎📩 ⇠〘 .تليجراف 〙*    
> *⏎* رفع الصور و الفديوهات الى تليجراف. 
*✎╎🐼 ⇠〘 .لكرتون 〙*    
> *⏎* يحول صورك لكرتون مع تحويل الوجه لاستيكر. 
*✎╎🏮 ⇠〘 .لانمي 〙*    
> *⏎* تحويل صورك لانمي بالذكاء الاصطناعي. 
*✎╎🎙️ ⇠〘 .انطق 〙*    
> *⏎* تحويل النص الى كلام. 
*✎╎🎼 ⇠〘 .لصوت〙*  
> *⏎* يحول الفيديو الى صوت. 
*✎╎🎃 ⇠〘 .جيف〙*  
> *⏎* يحول الملصق الى جيف. 
*✎╎⬆️ ⇠〘 .تحسين〙*  
> *⏎* تحسين الصوره. 
*✎╎♐ ⇠〘 .جوده〙*  
> *⏎* يرفع جودة الصوره. 
━ ── • ⟐ • ── ━
 *˼‏🔎˹ قـسـم الـتحميلات و البحث╿↶*
━ ── • ⟐ • ── ━
*✎╎🎦 ⇠〘 .تيك 〙*    
> *⏎* ينزل فيديو من التيك توك بدون علامة مائية برابط. 
*✎╎📱 ⇠〘 .تيك1 〙*  
> *⏎* يبحث عن اشخاص في التيك توك. 
*✎╎🎞️ ⇠〘 .فيديو 〙*    
> *⏎* يحمل اي فيديو يوتيوب. 
*✎╎🎥⇠〘 .فيديو2 〙*
> *⏎* لتيحمل اي فيديوهات يوتيوب ب استخدام لينك. 
*✎╎🍥 ⇠〘 .انستا 〙*    
> *⏎* يحملك فيديوهات من الانستا.
*✎╎📱 ⇠〘 .انستجرام 〙* 
> *⏎* يبحث عن شخص في الانستجرام. 
✎╎ 💠⇠〘 .فيس 〙*    
> *⏎* يحملك اي فيديو من الفيس. 
*✎╎🎶 ⇠〘 .اغنيه 〙*    
> *⏎* يحملك اي اغنيه من يوتيوب. 
*✎╎⬇️ ⇠〘 .تطبيق  〙*    
> *⏎* يحمل برامج APK. 
*✎╎🖼️ ⇠〘 .تيك_صور 〙*    
> *⏎* يحمل صور من تيك توك عن طريق لينك. 
*✎╎📻 ⇠〘 .شغل〙*    
> *⏎* يشغل لك اي اغنيه تريد سماعها. 
*✎╎📺 ⇠〘 .شغل1〙*    
> *⏎* يشغل لك اي فيديو ترغب في مشاهدتة. 
*✎╎💌 ⇠〘 .كابكت〙*    
> *⏎*  تحميل من كابكت. 
*✎╎📽⇠〘 .يوتيوب〙*  
> *⏎*  تحميل مقاطع فيديو من اليوتيوب. 
*✎╎📸 ⇠〘 .صوره〙*  
> *⏎*  تحميل اي صوره تريدها اكتب اسم الصوره. 
*✎╎🔎 ⇠〘 .البحث〙*  
> *⏎*  يبحث اي شي تريد. 
*✎╎🔍 ⇠〘 .ويكيبيديا〙*  
> *⏎* يعطيك معلومات اي شي تريد معرفتها. 
*✎╎🌐 ⇠〘 .جوجل〙*  
> *⏎* يلتقط لك صوره البحث الذي تريد.
 *✎╎✖️ ⇠〘 .تويتر〙*  
> *⏎* تحميل الفيديوهات من التويتر بستخدام رابط. 
*✎╎🎬 ⇠〘 .فيلم〙*  
> *⏎* يعطيك معلومات عن الفيلم الذي تريد ان تبحث عنه.
*✎╎🔔 ⇠〘 .انستجرام〙*  
> *⏎* اعطيه اسم الشخص الذي تريد البحث عنه.
*✎╎📔 ⇠〘 .تحميل-كتاب〙*   
> *⏎* تحميل بعض الكتب اكتب اسم الكتاب صح.
*✎╎🏫 ⇠〘 .معرض〙*  
> *⏎* تبحث عن اي معرض اذا كان موجود.
*✎╎🧐 ⇠〘 .تخيل〙*  
> *⏎* اتخيل اي صوره و البوت يرسلها لك.
*✎╎🌐 ⇠〘 .جيثوب〙*  
> *⏎* تبحث عن حساب اي شخص في GitHub.   
*✎╎🛑 ⇠〘 .ميجا〙*   
> *⏎*  يحمل اي شي. 
*✎╎📀 ⇠〘 .مسلسل〙*  
> *⏎* يبحث عن مسلسل. 
*✎╎🌐 ⇠〘 .قوقل〙*  
> *⏎* يعطيك معلومات من قوقل. 
*✎╎™️ ⇠〘 .عنصر〙*  
> *⏎* البحث عن عنصر كيميائيّ و يعطيك معلوماته.
*✎╎🗼 ⇠〘 .انمي〙*  
> *⏎* البحث عن انمي و يعطيك معلوماته ويحمل حتى فيديوهات. 
*✎╎📓 ⇠〘 .مانجا〙*  
> *⏎* البحث عن المانجا و يعطيك معلوماته.
*✎╎🇾🇪 ⇠〘 .دوله〙*  
> *⏎* بحث اسم الدولة و يعطيك معلوماتها. 
*✎╎🎹 ⇠〘 .الاسم〙*  
> *⏎* تعطيه مقطع صوت و يعطيك معلومات الاغنيه. 
*✎╎☎️ ⇠〘 .بحث-رقم〙*  
> *⏎* تعطيه رقم و يبحت عنه و يعطيك معلومات. 
*✎╎🖥 ⇠〘 .تعقب〙*  
> *⏎* يبحث عن انمي. 
*✎╎🏬 ⇠〘 .متجر〙* 
> *⏎* يحمل تطبيقات من المتجر. 
━ ── • ⟐ • ── ━
 *˼‏🤖˹ قـسـم الـذكاء الاصطناعي╿↶*
━ ── • ⟐ • ── ━
*✎╎🤖 ⇠〘 .غوكو 〙*    
> *⏎*  اسأل البوت اي سؤال. 
*✎╎👾 ⇠〘 .بوت 〙*    
> *⏎* ذكاء اصطناعي جانبي أسأله اي سؤال. 
*✎╎🐦 ⇠〘 .سمسم 〙*    
> *⏎* ذكاء اصطناعي تكلمه و يكلمك. 
*✎╎🖋 ⇠〘 .عمرو〙*  
> *⏎* ذكاء اصطناعي اخبره اي شيء.
*✎╎🖌 ⇠〘 .ارسم〙*  
> *⏎*  يرسم اي شي تطلبه. 
*✎╎🤖 ⇠〘 .دحيح〙*  
> *⏎*  ذكاء اصطناعي يجيب على اي سؤال و يقراء الصور ايضاً. 
*✎╎👀 ⇠〘 .شوف〙*  
> *⏎* يقراء الصور و يعطيك المعلومات الي فيها. 
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب1 سؤال وإجابه╿↶*
━ ── • ⟐ • ── ━
 *✎╎☪️⇠〘.دين〙*    
> *⏎* يسألك اسأله دينيه. 
*✎╎🔢 ⇠〘 .الرياضيات 〙*    
> *⏎* يرسل لك اسألة رياضيات ب مستويات. 
*✎╎⚽ ⇠〘 .رياضه〙*    
> *⏎* يسألك اسأله عن كرة القدم. 
*✎╎🖋️⇠〘 .كت 〙*    
> *⏎* لعبة كتابة للتسلية. 
*✎╎🏷️⇠〘 .فكك 〙*    
> *⏎* يجيبلك كلمة تفككها. 
*✎╎🗂️ ⇠〘 .رتب 〙*    
> *⏎* يجيبلك احرف مبعثرة وانت ترتبها. 
*✎╎🗝️ ⇠〘 .خمن 〙*    
> *⏎* يوصفلك شخصية انمي وانت تحاول تخمنها. 
*✎╎🎭 ⇠〘 .اموجي 〙*    
> *⏎* احزر الشخصيه من الايموجي. 
*✎╎🎧 ⇠〘 .تخمين 〙*    
> *⏎* تخمن الشخصية من الصوت. 
*✎╎👁 ⇠〘 .عين 〙*    
> *⏎* صور عيون لشخصيات انمي للتسليه. 
*✎╎🎭 ⇠〘 .احزر 〙*    
> *⏎* البوت يرسل صور انمي للتسلية و تكتب اسم الشخصية. 
*✎╎🚩 ⇠〘 .علم 〙*    
> *⏎* احزر صورة العلم. 
*✎╎⚽ ⇠〘 .كوره 〙*    
> *⏎* يجبلك صورة لاعب كوره وانت تجاوب. 
*✎╎🌍 ⇠〘 .ثقافه〙*   
> *⏎* يجبلك سؤال عن العالم. 
*✎╎🥌 ⇠〘 .تحدي〙*  
> *⏎* تلعب انت و شخص حجره ورقة مقص.  
*✎╎👾 ⇠〘 .العاب〙*  
> *⏎* يرسل البوت صوره لعبه و انت تخمن اسم اللعبه.
*✎╎🙃 ⇠〘 .عكس〙*   
> *⏎* يعطيك جمله معكوسه و انت تعدلها. 
*✎╎🧧 ⇠〘 .مانغا〙*  
> *⏎* يعطي صوره في المانغا و انت تجيب عليها. 
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب2 العاب متطوره╿↶*
━ ── • ⟐ • ── ━
*✎╎🎲 ⇠〘 .نرد〙*    
> *⏎*  يرسل نرد عشوائي. 
*✎╎🧞‍♂️ ⇠〘 .المارد 〙*    
> *⏎* لعبة المارد الأزرق للتسليه. 
*✎╎🔰⇠〘 .تحدي 〙*    
> *⏎* لعبة حجر ورقة مقص. 
*✎╎🎮 ⇠〘 .اكس او 〙*    
> *⏎* لعبة اكس او. 
*✎╎🎰⇠〘.رهان〙*    
> *⏎* راهن ب رقم من نقاتك لو خسرت بتخسرها. 
*✎╎♟️ ⇠〘 .شطرنج〙*    
> *⏎* للعب لعبة الشطرنج. 
*✎╎⚔️ ⇠〘 .حرب〙*   
> *⏎* تكون فريقين و تتحاربو. 
*✎╎🧨 ⇠〘 .متفجرات〙*  
> *⏎*  يرسل لك مربعات و تختار مربع. 
*✎╎👾 ⇠〘 .فيروس〙*  
> *⏎* فعاليه الفيروس.  
*✎╎💴 ⇠〘 .ريال〙*  
> *⏎* تلعب صوره او كتابة.
*✎╎🐍 ⇠〘 .سلم_وثعبان〙*  
> *⏎* تلعب لعبة سلم و الثعبان. 
*✎╎🤼‍♂️ ⇠〘 .مسابقه〙*  
> *⏎* يعمل البوت مسابقه. 
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب3 كتابه واسأله╿↶*
━ ── • ⟐ • ── ━
*✎╎❓ ⇠〘 .سؤال 〙*    
> *⏎* اسئلة عشوائية للتسلية مع الاصدقاء
*✎╎📋 ⇠〘 .لو 〙*    
> *⏎*لعبة لو خيروك للتسلية مع الاصدقاء. 
*✎╎🎫 ⇠〘 .تاج 〙*    
> *⏎* البوت يقترحلك رقم منشن وانت تنمشنه. 
*✎╎🧩 ⇠〘 .فزوره 〙*    
> *⏎* اسئلة فوازير للتسلية. 
*✎╎✅ ⇠〘 .صراحه 〙*    
> *⏎* اسئلة وتجاوب عليها بصراحة. 
*✎╎🧩 ⇠〘 .حروف 〙*    
> *⏎* يجيبلك حروف ل اسماء عشوائيه. 
*✎╎📢 ⇠〘 .مقوله 〙*    
> *⏎* يجيبلك مقولات انمي. 
*✎╎🍀 ⇠〘 .نصيحه 〙*    
> *⏎* البوت ينصحك نصيحة. 
*✎╎✏️ ⇠〘 كت〙*  
> *⏎* يرسل البوت اسم و انت تكتب نفسه. 
*✎╎🙄 ⇠〘 .احرجني〙*  
> *⏎* يحرجك البوت بسؤال.  
*✎╎✨ ⇠〘 .تويت〙*  
> *⏎* يرسل لك سؤال. 
*✎╎🌺 ⇠〘 .بوست〙*  
> *⏎*  يرسل لك حكمه. 
*✎╎📄 ⇠〘 .نصايح〙*  
> *⏎* يعطيك نصايح. 
*✎╎🎤 ⇠〘 .اسئلني〙*  
> *⏎* يسئلك سؤال. 
*✎╎🧶⇠〘 .غزل〙*  
> *⏎* يرسلك بيت غزل. 
*✎╎🪄 ⇠〘 .تشكيل〙*  
> *⏎*  البوت يشكل الاسم الذي تعطيه. 
*✎╎❤ ⇠〘 .قلب〙*  
> *⏎* يرسل البوت لك قلوب. 
*✎╎🤹‍♂️ ⇠〘 .تحداني〙*  
> *⏎*  البوت يتحداك ان تجيب الي يرسله لك. 
*✎╎🥷🏻 ⇠〘 .نينجا〙*  
> *⏎* اكتب له اسمك بالانجليزي و هو يكتبه بالنينجا.  
*✎╎🚩 ⇠〘 .دولتي〙*  
> *⏎* يخمن البوت دولتك. 
━ ── • ⟐ • ── ━
*˼‏🕹️˹ قـسـم العاب4 العاب المنشن ╿↶*
━ ── • ⟐ • ── ━
*✎╎🔝 ⇠〘 .توب 〙*    
> *⏎* يجيبك لك افضل 10 في القروب. 
*✎╎🧑‍🤝‍🧑 ⇠〘 .صداقه 〙*    
> *⏎* يصادق اثنين عشوائي من الجروب. 
*✎╎💍 ⇠〘 .زواج 〙*    
> *⏎* بزوج اثنين عشوائي من الجروب. 
*✎╎💔 ⇠〘 .طلاق 〙*    
> *⏎* يطلق اثنين عشوائي من الجروب. 
*✎╎ 👬🏼⇠〘 .توام 〙 *    
> *⏎* يجيب توأمك الروحي. 
*✎╎👨🏻‍💼 ⇠〘 .شخصيه〙*  
> *⏎* تمنشن شخص و تشوف شخصيته.  
*✎╎👫🏻 ⇠〘 .زوجني〙*  
> *⏎* يزوجك بشخص من الجروب.
*✎╎🎇⇠〘 .عرس〙*  
> *⏎* البوت يسوي عرس بين شخصين. 
━ ── • ⟐ • ── ━
*˼‏🏛️˹ قـسـم البنك╿↶*
━ ── • ⟐ • ── ━
*✎╎📊 ⇠〘 .رانك 〙*    
> *⏎* لمعرفة عدد مستواك ونقاتك في الفعاليات والماسك وبياناتك كلما تفاعلت مع البوت وتربح فعاليات وتتفاعل يرفع مستواك في تصنيفات. 
*✎╎🏦 ⇠〘 .البنك 〙*    
> *⏎* يجيبلك حساب نقاط فعاليات البوت. 
*✎╎🏦 ⇠〘 .لفل 〙*    
> *⏎* يجيبلك نقاتك وعدد الماسك ورتبتك. 
*✎╎💰⇠〘.شراء〙*    
> *⏎* اذا اردت شراء الماس واكتب الكميه مثال .شراء 1.
*✎╎🎁 ⇠〘 .يومي 〙*    
> *⏎* يعطيك هديه يوميه. 
*✎╎💱 ⇠〘 .حول 〙*    
> *⏎* لتحويل نقاتك الي شخص اخر. 
*✎╎📈 ⇠〘 .تصنيف 〙*    
> *⏎* يجيب اكثر اشخاص ربحو نقاط من البوت. 
*✎╎🏧 ⇠〘 .رصيد〙*  
> *⏎* يرسل رصيدك. 
*✎╎🏭 ⇠〘 .صناعة〙*  
> *⏎* صناعة اي شي. 
*✎╎🔖 ⇠〘 .بروفايل〙* 
> *⏎* يرسل بروفايلك فيه كل بياناتك. 
*✎╎👛 ⇠〘 .محفضه〙*  
> *⏎* يرسل لك محفضتك و تشوف نقتطك. 
*✎╎💵 ⇠〘 .نقود〙*  
> *⏎* يرسل كم معك نقود. 
*✎╎🪪 ⇠〘 .عمل〙*  
> *⏎*  يعطيك البوت عمل و تكسب نقاط.
*✎╎💳 ⇠〘 .بيع〙*  
> *⏎* بيع عملات. 
━ ── • ⟐ • ── ━
*˼‏🖼️˹ قـسـم الصور والايدت╿↶*
━ ── • ⟐ • ── ━
*✎╎💕 ⇠〘 .ميكو 〙*    
> *⏎* يجيبلك صوره ل ميكو. 
*✎╎🖼️ ⇠〘 .خلفيه 〙*    
> *⏎* يرسل خلفيات انمي. 
*✎╎🐧 ⇠〘 .ميمز 〙*    
> *⏎* يرسل ميمز انمي. 
*✎╎👩‍❤️‍👨 ⇠〘 .طقم 〙*    
> *⏎* يجيبلك طقم ولاد و بنات. 
*✎╎🧒 ⇠〘 .طقم_اولاد 〙*    
> *⏎* يجيبلك صور اولاد. 
*✎╎👧🏻 ⇠〘 .طقم_بنات 〙*    
> *⏎* يجيبلك طقم بنات. 
*✎╎🐈‍⬛ ⇠〘 .قط 〙*    
> *⏎* صور لقطط عشوائية. 
*✎╎📹 ⇠〘 .ايديت 〙*    
> *⏎* البوت يرسل ايدت انمي. 
*✎╎👰🏻 ⇠〘 .بنت〙*  
> *⏎* صور بنات انمي. 
*✎╎🐶 ⇠〘 .كلب 〙*  
> *⏎* يجيب لك صورة كلب. 
*✎╎🧸 ⇠〘 .دبدوب〙*  
> *⏎* صور دب. 
*✎╎⚽ ⇠〘 .رونالدو〙*  
> *⏎* صور كرستيانو رونالدو. 
*✎╎🐐 ⇠〘 .ميسي〙*  
> *⏎* صور ميسي. 
━ ── • ⟐ • ── ━
*˼‏👥˹ قـسـم الاعـضــاء╿↶*
━ ── • ⟐ • ── ━
*✎╎❔ ⇠〘 .هل 〙*    
> *⏎* أسأل غوكو اي سؤال ب هل
*✎╎🍡 ⇠〘 .انيمي 〙*    
> *⏎* اكتب اسم انمي يجيلك
*✎╎📊⇠〘 .نسبه 〙*    
> *⏎* يقيس لك نسبتك في الجروب
✎╎ 💞 ⇠〘 .حب 〙*    
> *⏎* منشن شخص يقيص نسبت حبكم
*✎╎🖼️ ⇠〘 .بروفايل 〙*    
> *⏎*  يجبلك بياناتك
*✎╎👤 ⇠〘 .شخصيه 〙*    
> *⏎*   يجيب نسبة شخصيتك
*✎╎💫 ⇠〘 .خط 〙*    
> *⏎* زخرفة الكلمات للاسف انجليزي بس
*✎╎🔰 ⇠〘 .دمج 〙*    
> *⏎* دمج الايموجي وتكوين ستيكر
*✎╎💭 ⇠〘 .تصميم ♕1الى12♕ 〙*    
> *⏎* الحصول على تصميم من البوت
*✎╎🔍 ⇠〘 .بحث 〙*    
> *⏎* البحث في غوغل
*✎╎👨🏻‍💻 ⇠〘 .المطور 〙*    
> *⏎* يجيبلك رقم مطور البوت
*✎╎📌⇠〘.الخصوصيه〙*    
> *⏎* يظهر لك بيانات المطور
*✎╎🚨 ⇠〘 .ابلاغ 〙*    
> *⏎*  إذا لديك  مشكله في البوت كلم المطور. 
*✎╎✍🏻 ⇠〘 .الصانع 〙*    
> *⏎* يرسل لك الصانع و بياناته. 
*✎╎🎙️ ⇠〘 .انطق 〙*    
> *⏎* ينطق صوت عربي او انجليزي. 
*✎╎🎩 ⇠〘 .لقبني〙*  
> *⏎* تختار لقب يسجله البوت عنده. 
*✎╎🏷 ⇠〘 .لقب〙*  
> *⏎* تبحث عن لقب شخص او اسم الشخصيه.
*✎╎📝 ⇠〘 .الالقاب〙*  
> *⏎* قائمة الالقاب المأخوذة. 
*✎╎📏 ⇠〘 .اختصار〙*  
> *⏎* يختصر الروابط.
*✎╎📭 ⇠〘 .بريد〙*  
> *⏎* يعطيك بريد اكتروني وهمي. 
*✎╎📎 ⇠〘 .رابط〙*  
> *⏎* يسوي لك رابط.
*✎╎📎 ⇠〘 .رابطي〙*  
> *⏎* يعطيك رابطك.
*✎╎🏷 ⇠〘 .بايو〙*  
> *⏎* يعطيك البايو حقك. 
*✎╎⚜️ ⇠〘 .رمزي〙*  
> *⏎* يصنع رمز لك. 
*✎╎🪦 ⇠〘 .موت〙*  
> *⏎* يجعل خلفيتك موت.  
*✎╎🔪 ⇠〘 .قتل〙*  
> *⏎* تمنشن شخص و تقتله. 
━ ── • ⟐ • ── ━
*˼‏🖥️˹ قـسـم المطور╿↶*
━ ── • ⟐ • ── ━
*✎╎👑 ⇠〘 .بريم 〙*    
> *⏎* يمكن للمطور فقط اعطاء صلاحيات لاستخدام البوت
*✎╎🚫 ⇠〘 .بانشات 〙*    
> *⏎* حظر الشات للبوت.
*✎╎⭕ ⇠〘 .بانشاتفك 〙*    
> *⏎* الغاء حظر الشات للبوت. 
*✎╎🔐 ⇠〘 .المحظورين 〙*    
> *⏎*يجيبلك الارقام والشاتات المحظورة. 
*✎╎🌟 ⇠〘 .المميزين 〙*    
> *⏎* الاشخاص البيرميوم. 
*✎╎⛔ ⇠〘 .بلوك 〙*    
> *⏎* تخلي البوت يعمل لشخص بلوك. 
*✎╎✅ ⇠〘 .فكالبلوك 〙*    
> *⏎* يرفع البلوك عن المستخدم. 
*✎╎🚷 ⇠〘 .البلوكات 〙*    
> *⏎* الأشخاص الواخدين بلوك من البوت. 
*✎╎⚠️ ⇠〘 .بان 〙*    
> *⏎* حظر شخص من استخدام البوت. 
*✎╎🔓 ⇠〘 .بانفك 〙*    
> *⏎* يرفع البان عن المستخدم. 
✎╎ 🌐⇠〘 .تهكير 〙*    
>  ⏎* امر خاص للمطور. 
*✎╎🔛 ⇠〘 .انضم 〙*    
> *⏎* البوت ينضم لجروبات عن طريق الرابط. 
*✎╎🔚 ⇠〘 .اخرج 〙*    
> *⏎* البوت يخرج من الجروبات. 
*✎╎🚨 ⇠〘 .مهم 〙*    
> *⏎* يعمل منشن خفي للمطور فقط. 
*✎╎🎌 ⇠〘 .اعلان 〙*    
> *⏎* يعلن المطور عن تحديثات البوت. 
*✎╎🔄 ⇠〘 .اعاده〙*  
> *⏎* يعيد تشغيل البوت من جديد. 
━ ── • ⟐ • ── ━
*˼‏ ⚠️˹ مـلاحــظــة╿↶*
*╭ ⋅ ⋅ ── ⋅ ⋅ ── ✩ ── ⋅ ⋅ ── ⋅ ⋅ ╮*
*❶ - يمنع منعا بتا سب البوت.*
*❷ - استخدام البوت بشكل متوازن و بدون تسبب ازعاج للاعضاء.*
>  استمتع بالبوت و اذا حصل شي كلم المطور ☜https://wa.me/967774318278
>  تذكير فلسطين حرة 🇵🇸🫀🇾🇪
> و تمت الاوامر بحمد الله به اوامر مش موجودات هنا لذلك اكتب .المهام لتظهر لك جميع الاوامر 🙃👋. 
* ╰⋅ ⋅ ── ⋅ ⋅ ── ✩ ── ⋅ ⋅ ── ⋅ ⋅ ╯*

*~.¸¸ ❝ 𝑮𝑶𝑲𝑼 𝑩𝑶𝑻❝ ¸¸.~* 
`
  conn.sendMessage(m.chat, {
           video: { url: videoUrl }, caption: str,
     mentions: [m.sender,global.conn.user.jid],
     gifPlayback: true,gifAttribution: 0
       }, { quoted: m });
   };

handler.help = ['main']
handler.tags = ['group']
handler.command = ['الشرح']

export default handler