let handler = async (m, { conn }) => {
  let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
  let videoUrl = 'https://telegra.ph/file/9ffe02eb52dd5a0fd3619.png'
  let { name } = global.db.data.users[who]
  m.react('📯')
let str = `                 ┏────━━━━⊚📯⊚━━━━────┓
*⧉┆↵ اهـــلا بــك/ي ${name}*
*⧉┆📱: @${who.replace(/@.+/, '')}*
*⧉┆↜أنـا اسـمـــي ❮ ˹غـوكـو˼ ❯*
*⧉┆↜انــا خــادم الـسـیــد عــمــرو*
*✦━☆━ـ❃ ⊰ ⛩ ⊱ ❃ـ━☆━═✦*
*▪︎▪︎❯【✮ ســــوالــــف ✮】❮▪︎▪︎*

📕 | الامــر *⏎* همم  

📕 | الامــر *⏎* غوكو اسمع  

📕 | الامــر *⏎* غوكو انت انسان؟

📕 | الامــر *⏎* غوكو قول مياو

📕 | الامــر *⏎* غوكو منجدك؟

📕 | الامــر *⏎* افا

📕 | الامــر *⏎* عيوني

📕 | الامــر *⏎* غوكو انقلع

📕 | الامــر *⏎* غوكو اشتقت لك

📕 | الامــر *⏎* غوكو ملل

📕 | الامــر *⏎* غوكو منور

📕 | الامــر *⏎* غوكو اخرس

📕 | الامــر *⏎* غوكو صباح الخير

📕 | الامــر *⏎* غوكو مساء الخير

📕 | الامــر *⏎* ههههههه

📕 | الامــر *⏎* غوكو شتسوي

📕 | الامــر *⏎* غوكو كل تبن

📕 | الامــر *⏎* غوكو كيفك

📕 | الامــر *⏎* غوكو تحبني

📕 | الامــر *⏎* غوكو مع السلامة

📕 | الامــر *⏎* بــوو

📕 | الامر *⏎* بــخ

📕 | الامــر *⏎* غوكو صـلـي عـلـى الـنـبـي

📕 | الامــر *⏎*  غوكو ادعـيـة

📕 | الامــر *⏎* غوكو انــمــيــات طــويــلــة

📕 | الامــر *⏎* غوكو انــمــيــات قــصــيــرة

📕 | الامــر *⏎* غوكو تــقــبــل رشــاوي؟

📕 | الامــر *⏎* غوكو تــكــرهــنــي؟

📕 | الامــر *⏎* غوكو تــســت

📕 | الامــر *⏎* انــا رحــت

📕 | الامــر *⏎* غوكو احــبــك

📕 | الامــر *⏎* غوكو نــرتــبــط؟ 

📕 | الامــر *⏎* غوكو كــم عــمــرك؟

📕 | الامــر *⏎* غوكو اكــرهــك

📕 | الامــر *⏎* غوكو تــرانــي طــفــشــان

📕 | الامــر *⏎* غوكو قــول اونــي تــشــان

📕 | الامــر *⏎* غوكو وش اطــلــق انــمــي؟

📕 | الامــر *⏎* غوكو تــصــبــح عــلــى خــيــر

📕 | الامــر *⏎* غوكو اعــطــيــنــي بــوســة

✦═━━☆━ـ❃ ⊰ ⛩ ⊱ ❃ـ━☆━━═✦
*ل إلــغــاء تــنــشــيــط الــبــوت فــي هــذه الــمــجــمــوعــة 🛑*\n*اكــتــب .بــانــد*
          *.¸¸ ❝˼𝗚𝗼𝗸𝘂᯽𝐵𝑂𝑇˼❝ ¸¸.*
*┗────━━━━⊚📯⊚━━━━────┛*
`
  conn.sendMessage(m.chat, {
           video: { url: videoUrl }, caption: str,
     mentions: [m.sender,global.conn.user.jid],
     gifPlayback: true,gifAttribution: 0
       }, { quoted: m });
   };

handler.help = ['main']
handler.tags = ['group']
handler.command = ['سوالف']

export default handler
